[
    {
        "name": "White Rice",
        "cuisine": "Chinese",
        "time": "30",
        "ingredients": "White Rice",
        "instructions": "Add rice and water in a 1:2 ratio to a rice cooker and cook. Optionally serve with furikake"
    },
    {
        "name": "Fried Rice",
        "cuisine": "Chinese",
        "time": "",
        "ingredients": "",
        "instructions": ""
    },
    {
        "name": "Congee",
        "cuisine": "Chinese",
        "time": "30",
        "ingredients": "White Rice",
        "instructions": "Add rice and water in a 1:3 ratio to a rice cooker with the lid open. Optionally cook with sweet potato or serve with dried pork"
    },
    {
        "name": "Egg Roll",
        "cuisine": "Chinese",
        "time": "",
        "ingredients": "",
        "instructions": ""
    },
    {
        "name": "Spring Roll",
        "cuisine": "Chinese",
        "time": "",
        "ingredients": "",
        "instructions": ""
    },
    {
        "name": "Mashed Potatoes",
        "cuisine": "American",
        "time": "25",
        "ingredients": "Potato, Butter, Milk, Salt, Pepper, Parmesan Cheese",
        "instructions": "Wash, peel, and cut the potato into chunks. Parboil with salted water, then simmer until fork-tender. Drain, mash, and mix with warm butter, milk, salt, and pepper. Stir under heat, then mix in Parmesan off heat"
    },
    {
        "name": "French Fries",
        "cuisine": "American",
        "time": "35",
        "ingredients": "Potato, Salt",
        "instructions": "Wash, peel, and slice into sticks. Soak in ice water. Parboil with salted water, drain, and freeze until firm. Deep fry until golden brown. Sprinkle salt on top. Optionally serve with onion powder, garlic powder, paprika, or ketchup"
    },
    {
        "name": "Home Fries",
        "cuisine": "American",
        "time": "25",
        "ingredients": "Potatoes, Onions, Salt, Pepper, Onion Powder, Garlic Powder, Paprika, Parsley",
        "instructions": "Dice the onions. Rinse the potatoes and cut them into cubes. Parboil with salted water and drain. Stir fry potatoes in oil. Add seasoning and onions. Cook until golden brown. Top with parsley. Optionally serve with ketchup"
    },
    {
        "name": "Baked Potato",
        "cuisine": "American",
        "time": "",
        "ingredients": "",
        "instructions": ""
    },
    {
        "name": "Scalloped Potatoes",
        "cuisine": "American",
        "time": "1.5 Hours",
        "ingredients": "Potatoes, Butter, Onions, Garlic, Flour, Milk, Salt, Pepper, Cheese",
        "instructions": "Preheat the oven. Slice the potatoes into thin circles and soak in cold water. Cook onions in butter for a few minutes, then add garlic and cook for another minute. Stir in flour to form a roux. Pour in milk to cover the ingredients. Season with salt and pepper. When the mixture boils, stir in shredded cheese. Layer the baking dish with potatoes and the cheese sauce, topping with extra cheese. Bake for about 1 hour until golden brown."
    }
]